# LeaderArray Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
LeaderArray Constructor
LeaderArray Class See Also
---
Initializes a new instance of the LeaderArray class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public LeaderArray()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
LeaderArray()
```

# See Also
LeaderArray Class
Autodesk.Revit.DB Namespace